
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # uptimerobot_monitor.uptimerobot_main["academiacivis"] will be created
  + resource "uptimerobot_monitor" "uptimerobot_main" {
      + auth_type                   = "HTTP_BASIC"
      + check_ssl_errors            = false
      + domain_expiration_reminder  = false
      + follow_redirections         = false
      + http_method_type            = "GET"
      + id                          = (known after apply)
      + interval                    = 300
      + keyword_case_type           = "CaseInsensitive"
      + keyword_type                = "ALERT_NOT_EXISTS"
      + keyword_value               = "Aviso Legal"
      + name                        = "academiacivis.es"
      + ssl_expiration_reminder     = false
      + status                      = (known after apply)
      + success_http_response_codes = [
          + "2xx",
          + "3xx",
        ]
      + timeout                     = (known after apply)
      + type                        = "KEYWORD"
      + url                         = "https://academiacivis.es"
    }

  # uptimerobot_monitor.uptimerobot_main["daniherranz"] will be created
  + resource "uptimerobot_monitor" "uptimerobot_main" {
      + auth_type                   = "HTTP_BASIC"
      + check_ssl_errors            = false
      + domain_expiration_reminder  = false
      + follow_redirections         = false
      + http_method_type            = "GET"
      + id                          = (known after apply)
      + interval                    = 300
      + keyword_case_type           = "CaseInsensitive"
      + keyword_type                = "ALERT_NOT_EXISTS"
      + keyword_value               = "Aviso Legal"
      + name                        = "daniherranz.com"
      + ssl_expiration_reminder     = false
      + status                      = (known after apply)
      + success_http_response_codes = [
          + "2xx",
          + "3xx",
        ]
      + timeout                     = (known after apply)
      + type                        = "KEYWORD"
      + url                         = "https://daniherranz.com"
    }

  # uptimerobot_monitor.uptimerobot_main["divisayhonor"] will be created
  + resource "uptimerobot_monitor" "uptimerobot_main" {
      + auth_type                   = "HTTP_BASIC"
      + check_ssl_errors            = false
      + domain_expiration_reminder  = false
      + follow_redirections         = false
      + http_method_type            = "GET"
      + id                          = (known after apply)
      + interval                    = 300
      + keyword_case_type           = "CaseInsensitive"
      + keyword_type                = "ALERT_NOT_EXISTS"
      + keyword_value               = "Aviso Legal"
      + name                        = "divisayhonor.es"
      + ssl_expiration_reminder     = false
      + status                      = (known after apply)
      + success_http_response_codes = [
          + "2xx",
          + "3xx",
        ]
      + timeout                     = (known after apply)
      + type                        = "KEYWORD"
      + url                         = "https://divisayhonor.es"
    }

  # uptimerobot_monitor.uptimerobot_main["doctorachups"] will be created
  + resource "uptimerobot_monitor" "uptimerobot_main" {
      + auth_type                   = "HTTP_BASIC"
      + check_ssl_errors            = false
      + domain_expiration_reminder  = false
      + follow_redirections         = false
      + http_method_type            = "GET"
      + id                          = (known after apply)
      + interval                    = 300
      + keyword_case_type           = "CaseInsensitive"
      + keyword_type                = "ALERT_NOT_EXISTS"
      + keyword_value               = "Aviso Legal"
      + name                        = "doctorachups.com"
      + ssl_expiration_reminder     = false
      + status                      = (known after apply)
      + success_http_response_codes = [
          + "2xx",
          + "3xx",
        ]
      + timeout                     = (known after apply)
      + type                        = "KEYWORD"
      + url                         = "https://doctorachups.com"
    }

  # uptimerobot_monitor.uptimerobot_main["inmocorner"] will be created
  + resource "uptimerobot_monitor" "uptimerobot_main" {
      + auth_type                   = "HTTP_BASIC"
      + check_ssl_errors            = false
      + domain_expiration_reminder  = false
      + follow_redirections         = false
      + http_method_type            = "GET"
      + id                          = (known after apply)
      + interval                    = 300
      + keyword_case_type           = "CaseInsensitive"
      + keyword_type                = "ALERT_NOT_EXISTS"
      + keyword_value               = "Aviso Legal y Cookies"
      + name                        = "inmocorner.com"
      + ssl_expiration_reminder     = false
      + status                      = (known after apply)
      + success_http_response_codes = [
          + "2xx",
          + "3xx",
        ]
      + timeout                     = (known after apply)
      + type                        = "KEYWORD"
      + url                         = "https://inmocorner.com"
    }

  # uptimerobot_monitor.uptimerobot_main["taxiencarballo"] will be created
  + resource "uptimerobot_monitor" "uptimerobot_main" {
      + auth_type                   = "HTTP_BASIC"
      + check_ssl_errors            = false
      + domain_expiration_reminder  = false
      + follow_redirections         = false
      + http_method_type            = "GET"
      + id                          = (known after apply)
      + interval                    = 300
      + keyword_case_type           = "CaseInsensitive"
      + keyword_type                = "ALERT_NOT_EXISTS"
      + keyword_value               = "Política de Cookies"
      + name                        = "taxiencarballo.com"
      + ssl_expiration_reminder     = false
      + status                      = (known after apply)
      + success_http_response_codes = [
          + "2xx",
          + "3xx",
        ]
      + timeout                     = (known after apply)
      + type                        = "KEYWORD"
      + url                         = "https://taxiencarballo.com"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
